
let text_base = "Видеокурсы тормозят вас. В среднем,  русская речь произносится со скоростью 130 слов в минуту, когда вы способны читать со скоростью более 240 слов.";
// let concise_material = "Материал в учебниках очень подробный, с тоннами информации. Наши курсы дают вам ровно столько, сколько необходимо для сдачи ЕГЭ."
let concise_material = "Наши курсы дают вам ровно столько, сколько необходимо для сдачи ЕГЭ. Если же вы хотите знать больше, мы скажем, где найти информацию!"
let flexible_format = "Нет необходимости проходить все - выбирайте только те темы, в которых вы чувствуете себя неуверенно.";
let practise = "Прошли курс? Самое время потренироваться - участвуйте в турнирах и зарабатывайте зефирки! Уиии";

export  {text_base, concise_material, flexible_format, practise};
							
